{
    "prompt_template": "Answer the question based on the provided context:\n\nContext:\n{context}\n\nQuestion: {question}",
    "question": "Why are auroras usually green?",
    "context": "An aurora (pl. aurorae or auroras), also commonly known as the northern lights (aurora borealis) or southern lights (aurora australis), is a natural light display in Earth's sky, predominantly seen in high-latitude regions (around the Arctic and Antarctic). Auroras display dynamic patterns of brilliant lights that appear as curtains, rays, spirals, or dynamic flickers covering the entire sky.\n Auroras are the result of disturbances in the Earth's magnetosphere caused by the solar wind. Major disturbances result from enhancements in the speed of the solar wind from coronal holes and coronal mass ejections. These disturbances alter the trajectories of charged particles in the magnetospheric plasma. These particles, mainly electrons and protons, precipitate into the upper atmosphere (thermosphere/exosphere). The resulting ionization and excitation of atmospheric constituents emit light of varying colour and complexity. The form of the aurora, occurring within bands around both polar regions, is also dependent on the amount of acceleration imparted to the precipitating particles.\n Most of the planets in the Solar System, some natural satellites, brown dwarfs, and even comets also host auroras.\n Colors and wavelengths of auroral light.\n Red: At its highest altitudes, excited atomic oxygen emits at 630 nm (red); low concentration of atoms and lower sensitivity of eyes at this wavelength make this color visible only under more intense solar activity. The low number of oxygen atoms and their gradually diminishing concentration is responsible for the faint appearance of the top parts of the 'curtains'. Scarlet, crimson, and carmine are the most often-seen hues of red for the auroras.\n Green: At lower altitudes, the more frequent collisions suppress the 630 nm (red) mode: rather the 557.7 nm emission (green) dominates. A fairly high concentration of atomic oxygen and higher eye sensitivity in green make green auroras the most common. The excited molecular nitrogen (atomic nitrogen being rare due to the high stability of the N2 molecule) plays a role here, as it can transfer energy by collision to an oxygen atom, which then radiates it away at the green wavelength. (Red and green can also mix together to produce pink or yellow hues.) The rapid decrease of concentration of atomic oxygen below about 100 km is responsible for the abrupt-looking end of the lower edges of the curtains. Both the 557.7 and 630.0 nm wavelengths correspond to forbidden transitions of atomic oxygen, a slow mechanism responsible for the graduality (0.7 s and 107 s respectively) of flaring and fading.\n Blue: At yet lower altitudes, atomic oxygen is uncommon, and molecular nitrogen and ionized molecular nitrogen take over in producing visible light emission, radiating at a large number of wavelengths in both red and blue parts of the spectrum, with 428 nm (blue) being dominant. Blue and purple emissions, typically at the lower edges of the 'curtains', show up at the highest levels of solar activity. The molecular nitrogen transitions are much faster than the atomic oxygen ones.\n Ultraviolet: Ultraviolet radiation from auroras (within the optical window but not visible to virtually all humans) has been observed with the requisite equipment. Ultraviolet auroras have also been seen on Mars, Jupiter, and Saturn.\n Infrared: Infrared radiation, in wavelengths that are within the optical window, is also part of many auroras.\n Yellow and pink are a mix of red and green or blue. Other shades of red, as well as orange and gold, may be seen on rare occasions; yellow-green is moderately common. As red, green, and blue are linearly independent colours, additive synthesis could, in theory, produce most human-perceived colours, but the ones mentioned in this article comprise a virtually exhaustive list."
}